Tekla Open API Reference for Tekla Structures 2025
StringList.LastIndexOf Method (String)
 Searches for the last occurence of the string in the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int LastIndexOf(
	string value
)
Public Function LastIndexOf (
	value As String
) As Integer
Parameters
value
Type: System.String
The string to locate.
Return Value
Type: Int32
The last index of the string if found, otherwise -1.
See Also
Reference
StringList Class
LastIndexOf Overload
Tekla.Structures.Drawing Namespace